{"class_name": "Model", "keras_version": "2.1.6", "backend": "tensorflow", "config": {"output_layers": [["time_distributed_1", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "name": "input_1", "dtype": "float32", "batch_input_shape": [null, 46]}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Embedding", "name": "embedding_1", "config": {"output_dim": 100, "mask_zero": false, "embeddings_regularizer": null, "dtype": "float32", "input_length": null, "batch_input_shape": [null, null], "name": "embedding_1", "activity_regularizer": null, "embeddings_constraint": null, "trainable": true, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "input_dim": 573}}, {"inbound_nodes": [[["embedding_1", 0, 0, {}]]], "class_name": "Bidirectional", "name": "bidirectional_1", "config": {"layer": {"class_name": "LSTM", "config": {"recurrent_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "return_state": false, "stateful": false, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "units": 128, "go_backwards": false, "bias_constraint": null, "activity_regularizer": null, "return_sequences": true, "implementation": 1, "recurrent_activation": "hard_sigmoid", "trainable": true, "activation": "tanh", "kernel_regularizer": null, "unroll": false, "name": "lstm_1", "recurrent_regularizer": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "use_bias": true}}, "merge_mode": "concat", "name": "bidirectional_1", "trainable": true}}, {"inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_1", "config": {"noise_shape": null, "rate": 0.25, "name": "dropout_1", "trainable": true, "seed": null}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "TimeDistributed", "name": "time_distributed_1", "config": {"name": "time_distributed_1", "layer": {"class_name": "Dense", "config": {"activation": "softmax", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "trainable": true, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "bias_constraint": null}}, "trainable": true}}], "input_layers": [["input_1", 0, 0]]}}